# FieldIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..FieldIndex Property
ScheduleField Class See Also
---
The index of the field in the containing ScheduleDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int FieldIndex { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FieldIndex As Integer
	Get
```

Visual C++
---
```text
public:
property int FieldIndex {
	int get ();
}
```

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace